In [41]:
import pandas as pd

In [42]:
invoices = pd.read_csv('https://raw.githubusercontent.com/FBosler/you-datascientist/master/invoices.csv')

In [43]:
invoices.head()

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,False
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,False
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch,False
3,YT796QI18WNGZ7ZJ,2014-04-12,C9SDFHF7553BE247,LJKS5NK6788CYMUU,2014-04-07 21:00:00+02:00,['Addie Patino'],438.0,Dinner,False
4,6YLROQT27B6HRF4E,2015-07-28,48EQXS6IHYNZDDZ5,LJKS5NK6788CYMUU,2015-07-27 14:00:00+02:00,['Addie Patino' 'Susan Guerrero'],690.0,Lunch,False

In [44]:
invoices.dtypes

Order Id              object
Date                  object
Meal Id               object
Company Id            object
Date of Meal          object
Participants          object
Meal Price           float64
Type of Meal          object
Heroes Adjustment       bool
dtype: object

In [45]:
invoices['Type of Meal'].unique()

array(['Breakfast', 'Dinner', 'Lunch'], dtype=object)

In [46]:
invoices['Type of Meal'] = invoices['Type of Meal'].astype('category')
invoices['Date'] = invoices['Date'].astype('datetime64')
invoices['Meal Price'] = invoices['Meal Price'].astype('int')

In [47]:
invoices.dtypes

Order Id                     object
Date                 datetime64[ns]
Meal Id                      object
Company Id                   object
Date of Meal                 object
Participants                 object
Meal Price                    int32
Type of Meal               category
Heroes Adjustment              bool
dtype: object

In [48]:
invoices.loc[45612,'Meal Price'] = 'I am causing trouble'
invoices.loc[35612,'Meal Price'] = 'Me too'

In [49]:
invoices['Meal Price'].astype(int)

ValueError: invalid literal for int() with base 10: 'Me too'

In [ ]:
invoices['Meal Price'].apply(lambda x: type(x)).value_counts()

In [ ]:
x='hello'
type(x)

In [ ]:
invoices[invoices['Meal Price'].apply(
  lambda x: isinstance(x,str)
)]['Meal Price']

In [ ]:
x = isinstance(5, int)
x

In [ ]:
pd.to_numeric(invoices['Meal Price'], errors='coerce')

In [ ]:
invoices[invoices['Meal Price'].apply(
  lambda x: isinstance(x,str)
)]['Meal Price']

In [ ]:
invoices['Meal Price'] = pd.to_numeric(invoices['Meal Price'],errors='coerce')

In [ ]:
invoices[invoices['Meal Price'].apply(
  lambda x: isinstance(x,str)
)]['Meal Price']

In [ ]:
invoices.isnull().sum()

In [ ]:
invoices['Meal Price'] = invoices['Meal Price'].fillna(invoices['Meal Price'].median())

In [ ]:
invoices.isnull().sum()

In [ ]:
invoices['Meal Price'].dtype

In [ ]:
invoices['Meal Price']=invoices['Meal Price'].astype(int)

In [ ]:
invoices['Meal Price'].dtype

In [ ]:
invoices['Date'].dtype

In [ ]:
invoices['Date of Meal'] = pd.to_datetime(invoices['Date of Meal'], utc=True)

In [ ]:
invoices['Date'].dtype

In [51]:
invoices['Type of Meal'].str.lower()

0        breakfast
1           dinner
2            lunch
3           dinner
4            lunch
           ...
50012    breakfast
50013    breakfast
50014       dinner
50015       dinner
50016        lunch
Name: Type of Meal, Length: 50017, dtype: object

In [52]:
invoices['Type of Meal'].str.zfill(width=15).head(3)

0    000000Breakfast
1    000000000Dinner
2    0000000000Lunch
Name: Type of Meal, dtype: object

In [54]:
invoices['Type of Meal'].str.endswith('ast').head(10)

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9    False
Name: Type of Meal, dtype: bool

In [55]:
invoices[invoices['Type of Meal'].str.endswith('ast')==True]

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Heroes Adjustment
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469,Breakfast,False
7,FM608JK1N01BPUQN,2014-05-08,E8WJZ1FOSKZD2MJN,36MFTZOYMTAJP1RK,2014-05-07 09:00:00+02:00,['Amanda Knowles' 'Cheryl Feaster' 'Ginger Hoa...,320,Breakfast,False
11,8RIGCF74GUEQHQEE,2018-07-23,5XK0KTFTD6OAP9ZP,36MFTZOYMTAJP1RK,2018-07-27 08:00:00+02:00,['Amanda Knowles'],210,Breakfast,False
12,TH60C9D8TPYS7DGG,2016-12-15,KDSMP2VJ22HNEPYF,36MFTZOYMTAJP1RK,2016-12-13 08:00:00+01:00,['Cheryl Feaster' 'Bret Adams' 'Ginger Hoagland'],755,Breakfast,False
17,KNF3E3QTOQ22J269,2018-06-20,737T2U7604ABDFDF,36MFTZOYMTAJP1RK,2018-06-15 07:00:00+02:00,['Glenn Gould' 'Cheryl Feaster' 'Ginger Hoagla...,475,Breakfast,False
...,...,...,...,...,...,...,...,...,...
50008,UHIE76EGIC2KFP34,2016-08-06,BFLY4LHHUI5OIREM,FC1LJXHNH2883N3Y,2016-08-08 08:00:00+02:00,['Jerry Nelson'],164,Breakfast,False
50009,FWH3N8N5ARW53BE6,2016-03-17,WHVI4J3J388I8I4B,FC1LJXHNH2883N3Y,2016-03-12 09:00:00+01:00,['Jon Ponce' 'Alice Allen'],523,Breakfast,False
50011,81J2RM0YM63VAT0K,2018-06-03,HNXSJZQ120WGAWZP,E4K99D4JR9E40VE1,2018-06-03 07:00:00+02:00,['Chester Mortimer' 'Robin Ramos'],598,Breakfast,False
50012,4OMS8ZSA0UX8LHWI,2017-09-20,1TD5MROATV1NHZ4Y,E4K99D4JR9E40VE1,2017-09-21 08:00:00+02:00,['Regina Shirley'],9,Breakfast,False
50013,RR0VKJN8V0KHNKGG,2018-03-19,22EX9VZSJKHP4AIP,E4K99D4JR9E40VE1,2018-03-18 09:00:00+01:00,['Robin Ramos' 'Chester Mortimer'],25,Breakfast,False

In [56]:
invoices['Type of Meal'].cat.ordered

False

In [57]:
# joining data

In [58]:
y_2013 = invoices[invoices['Date of Meal'].dt.year == 2013].copy()
y_2014 = invoices[invoices['Date of Meal'].dt.year == 2014].copy()

AttributeError: Can only use .dt accessor with datetimelike values

In [59]:
# Some code from data independent

In [62]:
#1 Melt function
import pandas as pd
import numpy as np

In [63]:
df = pd.DataFrame.from_dict({"Name": ['Liho Liho', 'Tompkins', 'The Square', 'Chambers'],
                             "8/4/2020": np.random.randint(10,200, size=(1,4))[0],
                             "8/5/2020": np.random.randint(12,200, size=(1,4))[0],
                             "8/6/2020": np.random.randint(12,200, size=(1,4))[0],
                             "8/7/2020": np.random.randint(12,200, size=(1,4))[0]}, orient='columns')
df

         Name  8/4/2020  8/5/2020  8/6/2020  8/7/2020
0   Liho Liho        98        30       141       114
1    Tompkins       140        87        27       100
2  The Square        82        53        20        95
3    Chambers       166       171       189        93

In [64]:
df.melt(id_vars='Name')

          Name  variable  value
0    Liho Liho  8/4/2020     98
1     Tompkins  8/4/2020    140
2   The Square  8/4/2020     82
3     Chambers  8/4/2020    166
4    Liho Liho  8/5/2020     30
5     Tompkins  8/5/2020     87
6   The Square  8/5/2020     53
7     Chambers  8/5/2020    171
8    Liho Liho  8/6/2020    141
9     Tompkins  8/6/2020     27
10  The Square  8/6/2020     20
11    Chambers  8/6/2020    189
12   Liho Liho  8/7/2020    114
13    Tompkins  8/7/2020    100
14  The Square  8/7/2020     95
15    Chambers  8/7/2020     93

In [65]:
df.melt(id_vars='Name', value_vars=['8/4/2020', '8/5/2020'])
# only a subset of 2 dates

         Name  variable  value
0   Liho Liho  8/4/2020     98
1    Tompkins  8/4/2020    140
2  The Square  8/4/2020     82
3    Chambers  8/4/2020    166
4   Liho Liho  8/5/2020     30
5    Tompkins  8/5/2020     87
6  The Square  8/5/2020     53
7    Chambers  8/5/2020    171

In [66]:
# customize column names

In [67]:
df.melt(id_vars='Name', var_name='Date', value_name='Transaction_Amount')

          Name      Date  Transaction_Amount
0    Liho Liho  8/4/2020                  98
1     Tompkins  8/4/2020                 140
2   The Square  8/4/2020                  82
3     Chambers  8/4/2020                 166
4    Liho Liho  8/5/2020                  30
5     Tompkins  8/5/2020                  87
6   The Square  8/5/2020                  53
7     Chambers  8/5/2020                 171
8    Liho Liho  8/6/2020                 141
9     Tompkins  8/6/2020                  27
10  The Square  8/6/2020                  20
11    Chambers  8/6/2020                 189
12   Liho Liho  8/7/2020                 114
13    Tompkins  8/7/2020                 100
14  The Square  8/7/2020                  95
15    Chambers  8/7/2020                  93

In [68]:
# using melt directly from pandas

In [69]:
pd.melt(df, id_vars='Name')

          Name  variable  value
0    Liho Liho  8/4/2020     98
1     Tompkins  8/4/2020    140
2   The Square  8/4/2020     82
3     Chambers  8/4/2020    166
4    Liho Liho  8/5/2020     30
5     Tompkins  8/5/2020     87
6   The Square  8/5/2020     53
7     Chambers  8/5/2020    171
8    Liho Liho  8/6/2020    141
9     Tompkins  8/6/2020     27
10  The Square  8/6/2020     20
11    Chambers  8/6/2020    189
12   Liho Liho  8/7/2020    114
13    Tompkins  8/7/2020    100
14  The Square  8/7/2020     95
15    Chambers  8/7/2020     93

In [70]:
# Pandas-Iterate over rows

In [71]:
# Method: 1

In [72]:
df = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30),
                   ('The Lighthouse', 'bar', 15.30),
                   ("Al's Place", 'Restaurant', 456.53)],
           columns=('name', 'type', 'AvgBill')
                 )
df

             name        type  AvgBill
0  Foreign Cinema  Restaurant   289.00
1       Liho Liho  Restaurant   224.00
2        500 Club         bar    80.50
3      The Square         bar    25.30
4  The Lighthouse         bar    15.30
5      Al's Place  Restaurant   456.53

We are first going to use pandas apply. This will run through each row and apply a function for us. I'll use a quick lambda function for this example. Make sure you're axis=1 to go through rows.

In [73]:
# Printing Name and AvgBill. In this case, "x" is a series with index of column names
df.apply(lambda x: print ("{} - {}".format(x['name'], x['AvgBill'])), axis=1)

Foreign Cinema - 289.0
Liho Liho - 224.0
500 Club - 80.5
The Square - 25.3
The Lighthouse - 15.3
Al's Place - 456.53

0    None
1    None
2    None
3    None
4    None
5    None
dtype: object

In [74]:
df1=df.copy()

In [77]:
df1['Rounding_avg_bill']=df1['AvgBill'].apply(lambda x: round(x,1))

In [78]:
df1

             name        type  AvgBill  Rounding_avg_bill
0  Foreign Cinema  Restaurant   289.00              289.0
1       Liho Liho  Restaurant   224.00              224.0
2        500 Club         bar    80.50               80.5
3      The Square         bar    25.30               25.3
4  The Lighthouse         bar    15.30               15.3
5      Al's Place  Restaurant   456.53              456.5

In [83]:
# Method:2 Iterrows. Returns index and its row

In [84]:
for index, contents in df.iterrows():
    print(index,contents)

0 name       Foreign Cinema
type           Restaurant
AvgBill               289
Name: 0, dtype: object
1 name        Liho Liho
type       Restaurant
AvgBill           224
Name: 1, dtype: object
2 name       500 Club
type            bar
AvgBill        80.5
Name: 2, dtype: object
3 name       The Square
type              bar
AvgBill          25.3
Name: 3, dtype: object
4 name       The Lighthouse
type                  bar
AvgBill              15.3
Name: 4, dtype: object
5 name       Al's Place
type       Restaurant
AvgBill        456.53
Name: 5, dtype: object

In [85]:
for index, contents in df.iterrows():
    print ("Index: {}".format(index))
    print ("{} - {}".format(contents['name'], contents['AvgBill']))
    print ()

Index: 0
Foreign Cinema - 289.0

Index: 1
Liho Liho - 224.0

Index: 2
500 Club - 80.5

Index: 3
The Square - 25.3

Index: 4
The Lighthouse - 15.3

Index: 5
Al's Place - 456.53

In [86]:
# Method: 3 datadictionary

In [87]:
df_dict = df.to_dict(orient='index')
df_dict

{0: {'name': 'Foreign Cinema', 'type': 'Restaurant', 'AvgBill': 289.0},
 1: {'name': 'Liho Liho', 'type': 'Restaurant', 'AvgBill': 224.0},
 2: {'name': '500 Club', 'type': 'bar', 'AvgBill': 80.5},
 3: {'name': 'The Square', 'type': 'bar', 'AvgBill': 25.3},
 4: {'name': 'The Lighthouse', 'type': 'bar', 'AvgBill': 15.3},
 5: {'name': "Al's Place", 'type': 'Restaurant', 'AvgBill': 456.53}}

In [88]:
for key in df_dict:
    print (key)
    print (df_dict[key])
    print (df_dict[key]['name'])
    print ()

0
{'name': 'Foreign Cinema', 'type': 'Restaurant', 'AvgBill': 289.0}
Foreign Cinema

1
{'name': 'Liho Liho', 'type': 'Restaurant', 'AvgBill': 224.0}
Liho Liho

2
{'name': '500 Club', 'type': 'bar', 'AvgBill': 80.5}
500 Club

3
{'name': 'The Square', 'type': 'bar', 'AvgBill': 25.3}
The Square

4
{'name': 'The Lighthouse', 'type': 'bar', 'AvgBill': 15.3}
The Lighthouse

5
{'name': "Al's Place", 'type': 'Restaurant', 'AvgBill': 456.53}
Al's Place

In [91]:
# Method: 4 :using itertuples returns tuples

In [92]:
for row in df.itertuples():
    print (row)
    print (row.name)
    print ()

Pandas(Index=0, name='Foreign Cinema', type='Restaurant', AvgBill=289.0)
Foreign Cinema

Pandas(Index=1, name='Liho Liho', type='Restaurant', AvgBill=224.0)
Liho Liho

Pandas(Index=2, name='500 Club', type='bar', AvgBill=80.5)
500 Club

Pandas(Index=3, name='The Square', type='bar', AvgBill=25.3)
The Square

Pandas(Index=4, name='The Lighthouse', type='bar', AvgBill=15.3)
The Lighthouse

Pandas(Index=5, name="Al's Place", type='Restaurant', AvgBill=456.53)
Al's Place

In [94]:
# method: 4 using iloc

In [95]:
for i in range(len(df)):
    print (df.iloc[i])
    print ()
    print ("Name: {}".format(df.iloc[i]['name']))
    print ("\n")

name       Foreign Cinema
type           Restaurant
AvgBill               289
Name: 0, dtype: object

Name: Foreign Cinema


name        Liho Liho
type       Restaurant
AvgBill           224
Name: 1, dtype: object

Name: Liho Liho


name       500 Club
type            bar
AvgBill        80.5
Name: 2, dtype: object

Name: 500 Club


name       The Square
type              bar
AvgBill          25.3
Name: 3, dtype: object

Name: The Square


name       The Lighthouse
type                  bar
AvgBill              15.3
Name: 4, dtype: object

Name: The Lighthouse


name       Al's Place
type       Restaurant
AvgBill        456.53
Name: 5, dtype: object

Name: Al's Place

In [96]:
x=df.iloc[0]

In [97]:
x

name       Foreign Cinema
type           Restaurant
AvgBill               289
Name: 0, dtype: object

In [98]:
x.dtype

dtype('O')

In [99]:
x['name']

'Foreign Cinema'

In [100]:
x['type']

'Restaurant'

In [101]:
x['AvgBill']

289.0

In [102]:
# just search a value of AvgBill=289 and find its row

In [106]:
for i in range(len(df)):
    if df.iloc[i]['AvgBill']==289:
        print('Value Found')
        print(df.iloc[i])

Value Found
name       Foreign Cinema
type           Restaurant
AvgBill               289
Name: 0, dtype: object

In [112]:
def search_column_value(df,col,val):
    for i in range(len(df)):
        if df.iloc[i][col]==val:
            return df.iloc[i]

In [115]:
search_column_value(df,'AvgBill',289)

name       Foreign Cinema
type           Restaurant
AvgBill               289
Name: 0, dtype: object

In [117]:
search_column_value(df,'name','500 Club')

name       500 Club
type            bar
AvgBill        80.5
Name: 2, dtype: object

In [118]:
df

             name        type  AvgBill
0  Foreign Cinema  Restaurant   289.00
1       Liho Liho  Restaurant   224.00
2        500 Club         bar    80.50
3      The Square         bar    25.30
4  The Lighthouse         bar    15.30
5      Al's Place  Restaurant   456.53

In [119]:
# using apply function

In [120]:
def print_outcome(x):
    print (type(x))
    print (x)
    print ()

In [121]:
df.apply(print_outcome, axis=0)

<class 'pandas.core.series.Series'>
0    Foreign Cinema
1         Liho Liho
2          500 Club
3        The Square
4    The Lighthouse
5        Al's Place
Name: name, dtype: object

<class 'pandas.core.series.Series'>
0    Restaurant
1    Restaurant
2           bar
3           bar
4           bar
5    Restaurant
Name: type, dtype: object

<class 'pandas.core.series.Series'>
0       289
1       224
2      80.5
3      25.3
4      15.3
5    456.53
Name: AvgBill, dtype: object

name       None
type       None
AvgBill    None
dtype: object

In [122]:
df.apply(print_outcome, axis=1)

<class 'pandas.core.series.Series'>
name       Foreign Cinema
type           Restaurant
AvgBill               289
Name: 0, dtype: object

<class 'pandas.core.series.Series'>
name        Liho Liho
type       Restaurant
AvgBill           224
Name: 1, dtype: object

<class 'pandas.core.series.Series'>
name       500 Club
type            bar
AvgBill        80.5
Name: 2, dtype: object

<class 'pandas.core.series.Series'>
name       The Square
type              bar
AvgBill          25.3
Name: 3, dtype: object

<class 'pandas.core.series.Series'>
name       The Lighthouse
type                  bar
AvgBill              15.3
Name: 4, dtype: object

<class 'pandas.core.series.Series'>
name       Al's Place
type       Restaurant
AvgBill        456.53
Name: 5, dtype: object

0    None
1    None
2    None
3    None
4    None
5    None
dtype: object

In [123]:
def combine_strings(row):
    return "{}, {}, {}".format(row['name'], row['type'], row['AvgBill'])

df.apply(combine_strings, axis=1)

0    Foreign Cinema, Restaurant, 289.0
1         Liho Liho, Restaurant, 224.0
2                  500 Club, bar, 80.5
3                The Square, bar, 25.3
4            The Lighthouse, bar, 15.3
5       Al's Place, Restaurant, 456.53
dtype: object

In [124]:
#2

In [125]:
flight=pd.read_csv('flight_data.csv')

In [126]:
flight

  operator_code  route_code duration
0           AXZ          12    2h 5m
1           DTR          32    3h 7m
2           AXZ          34    7h 3m
3           AXZ          12   2h 15m
4           YUN           8   1h 10m
5           YUN          12   2h 10m
6           YUN          13   3h 55m
7           DTR          16   3h 30m
8           DTR          18   6h 10m
9           AXZ          13   3h 45m

In [127]:
# convert duration column in minutes

In [128]:
d=flight['duration'][0]
d

'2h 5m'

In [129]:
d.split()

['2h', '5m']

In [133]:
int(d.split()[0].replace('h','')) * 60

120

In [134]:
int(d.split()[1].replace('m',''))

5

In [135]:
int(d.split()[0].replace('h','')) * 60+int(d.split()[1].replace('m',''))

125

In [137]:
for i,d in enumerate(flight.duration):
    dur=int(d.split()[0].replace('h','')) * 60+int(d.split()[1].replace('m',''))
    flight.loc[i,'dur_min']=dur

In [138]:
flight

  operator_code  route_code duration  dur_min
0           AXZ          12    2h 5m    125.0
1           DTR          32    3h 7m    187.0
2           AXZ          34    7h 3m    423.0
3           AXZ          12   2h 15m    135.0
4           YUN           8   1h 10m     70.0
5           YUN          12   2h 10m    130.0
6           YUN          13   3h 55m    235.0
7           DTR          16   3h 30m    210.0
8           DTR          18   6h 10m    370.0
9           AXZ          13   3h 45m    225.0

In [139]:
def duration(d):
    return int(d.split()[0].replace('h','')) * 60+int(d.split()[1].replace('m',''))

In [140]:
flight=pd.read_csv('flight_data.csv')

In [142]:
flight['dur_minutes']=flight['duration'].apply(duration)

In [144]:
flight

  operator_code  route_code duration  dur_minutes
0           AXZ          12    2h 5m          125
1           DTR          32    3h 7m          187
2           AXZ          34    7h 3m          423
3           AXZ          12   2h 15m          135
4           YUN           8   1h 10m           70
5           YUN          12   2h 10m          130
6           YUN          13   3h 55m          235
7           DTR          16   3h 30m          210
8           DTR          18   6h 10m          370
9           AXZ          13   3h 45m          225

In [145]:
flight=pd.read_csv('flight_data.csv')

In [146]:
flight

  operator_code  route_code duration
0           AXZ          12    2h 5m
1           DTR          32    3h 7m
2           AXZ          34    7h 3m
3           AXZ          12   2h 15m
4           YUN           8   1h 10m
5           YUN          12   2h 10m
6           YUN          13   3h 55m
7           DTR          16   3h 30m
8           DTR          18   6h 10m
9           AXZ          13   3h 45m

In [166]:

int(flight['duration'].str.split()[0][0][:-1])* 60 + int(flight['duration'].str.split()[0][1][:-1])

125

In [167]:
int(flight['duration'].str.split()[1][0][-2])* 60 + int(flight['duration'].str.split()[1][1][-2])

187

In [169]:
for i in range(len(flight)):
    print(int(flight['duration'].str.split()[i][0][:-1])* 60 + int(flight['duration'].str.split()[i][1][:-1]))

125
187
423
135
70
130
235
210
370
225

In [175]:
flight['dur_min']=flight['duration'].apply(lambda x:int(x.split()[0][:-1])* 60 + int(x.split()[1][:-1]))

In [176]:
flight

  operator_code  route_code duration  dur_min
0           AXZ          12    2h 5m      125
1           DTR          32    3h 7m      187
2           AXZ          34    7h 3m      423
3           AXZ          12   2h 15m      135
4           YUN           8   1h 10m       70
5           YUN          12   2h 10m      130
6           YUN          13   3h 55m      235
7           DTR          16   3h 30m      210
8           DTR          18   6h 10m      370
9           AXZ          13   3h 45m      225

In [177]:
boston=pd.read_csv('boston.csv')
boston.head()

,Unnamed: 0,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv
0,1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

In [184]:
for ind,row in boston.iterrows():
    boston.loc[ind,'Avg_price']=row['medv']/row['rm']

In [185]:
boston.head()

,Unnamed: 0,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,Avg_price
0,1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0,3.650190
1,2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6,3.363962
2,3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7,4.829506
3,4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4,4.772792
4,5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2,5.065062

In [186]:
flight

  operator_code  route_code duration  dur_min
0           AXZ          12    2h 5m      125
1           DTR          32    3h 7m      187
2           AXZ          34    7h 3m      423
3           AXZ          12   2h 15m      135
4           YUN           8   1h 10m       70
5           YUN          12   2h 10m      130
6           YUN          13   3h 55m      235
7           DTR          16   3h 30m      210
8           DTR          18   6h 10m      370
9           AXZ          13   3h 45m      225

In [190]:
flight.groupby('route_code')['dur_min'].sum()

route_code
8      70
12    390
13    460
16    210
18    370
32    187
34    423
Name: dur_min, dtype: int64

In [195]:
flight

  operator_code  route_code duration  dur_min
0           AXZ          12    2h 5m      125
1           DTR          32    3h 7m      187
2           AXZ          34    7h 3m      423
3           AXZ          12   2h 15m      135
4           YUN           8   1h 10m       70
5           YUN          12   2h 10m      130
6           YUN          13   3h 55m      235
7           DTR          16   3h 30m      210
8           DTR          18   6h 10m      370
9           AXZ          13   3h 45m      225

In [196]:
mult_group=flight.groupby(['operator_code','route_code'])['dur_min'].sum()

In [197]:
mult_group

operator_code  route_code
AXZ            12            260
               13            225
               34            423
DTR            16            210
               18            370
               32            187
YUN            8              70
               12            130
               13            235
Name: dur_min, dtype: int64

In [202]:
mult_group.loc['AXZ']

route_code
12    260
13    225
34    423
Name: dur_min, dtype: int64

In [203]:
mult_group.loc['AXZ'][12]

260

In [206]:
mult_group.iloc[0]

260

In [207]:
mult_group

operator_code  route_code
AXZ            12            260
               13            225
               34            423
DTR            16            210
               18            370
               32            187
YUN            8              70
               12            130
               13            235
Name: dur_min, dtype: int64

In [208]:
# find the maximum duration

In [217]:
mx=mult_group.idxmax()

In [218]:
mx

('AXZ', 34)

In [226]:
mult_group.loc[mx[0]][mx[1]]

423

In [211]:
# find row with max dur_min

In [213]:
mx=flight['dur_min'].idxmax()

In [214]:
flight.loc[mx]

operator_code      AXZ
route_code          34
duration         7h 3m
dur_min            423
Name: 2, dtype: object

In [227]:
flight

  operator_code  route_code duration  dur_min
0           AXZ          12    2h 5m      125
1           DTR          32    3h 7m      187
2           AXZ          34    7h 3m      423
3           AXZ          12   2h 15m      135
4           YUN           8   1h 10m       70
5           YUN          12   2h 10m      130
6           YUN          13   3h 55m      235
7           DTR          16   3h 30m      210
8           DTR          18   6h 10m      370
9           AXZ          13   3h 45m      225

In [229]:
flight.groupby('operator_code')['dur_min'].sum()

operator_code
AXZ    908
DTR    767
YUN    435
Name: dur_min, dtype: int64

In [230]:
flight.groupby('operator_code')['dur_min'].max()

operator_code
AXZ    423
DTR    370
YUN    235
Name: dur_min, dtype: int64

In [231]:
flight.groupby('operator_code')['dur_min'].min()

operator_code
AXZ    125
DTR    187
YUN     70
Name: dur_min, dtype: int64

In [233]:
flight

  operator_code  route_code duration  dur_min
0           AXZ          12    2h 5m      125
1           DTR          32    3h 7m      187
2           AXZ          34    7h 3m      423
3           AXZ          12   2h 15m      135
4           YUN           8   1h 10m       70
5           YUN          12   2h 10m      130
6           YUN          13   3h 55m      235
7           DTR          16   3h 30m      210
8           DTR          18   6h 10m      370
9           AXZ          13   3h 45m      225

In [240]:
fuel=pd.read_csv('fuel_econ.csv').head(20)
fuel

,id,make,model,year,VClass,drive,trans,fuelType,cylinders,displ,pv2,pv4,city,UCity,highway,UHighway,comb,co2,feScore,ghgScore
0,32204,Nissan,GT-R,2013,Subcompact Cars,All-Wheel Drive,Automatic (AM6),Premium Gasoline,6,3.8,79,0,16.4596,20.2988,22.5568,30.1798,18.7389,471,4,4
1,32205,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Automatic (AM-S6),Premium Gasoline,4,2.0,94,0,21.8706,26.9770,31.0367,42.4936,25.2227,349,6,6
2,32206,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.6,94,0,17.4935,21.2000,26.5716,35.1000,20.6716,429,5,5
3,32207,Volkswagen,CC 4motion,2013,Compact Cars,All-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.6,94,0,16.9415,20.5000,25.2190,33.5000,19.8774,446,5,5
4,32208,Chevrolet,Malibu eAssist,2013,Midsize Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,4,2.4,0,95,24.7726,31.9796,35.5340,51.8816,28.6813,310,8,8
5,32209,Lexus,GS 350,2013,Midsize Cars,Rear-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.5,0,99,19.4325,24.1499,28.2234,38.5000,22.6002,393,6,6
6,32210,Lexus,GS 350 AWD,2013,Midsize Cars,All-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.5,0,99,18.5752,23.5261,26.3573,36.2109,21.4213,412,5,5
7,32214,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Automatic 8-spd,Premium Gasoline,4,2.0,89,0,17.4460,21.7946,26.6295,37.6731,20.6507,432,5,5
8,32215,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Manual 6-spd,Premium Gasoline,4,2.0,89,0,20.6741,26.2000,29.2741,41.8000,23.8235,375,6,6
9,32216,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Automatic 8-spd,Premium Gasoline,6,3.8,89,0,16.4675,20.4839,24.5605,34.4972,19.3344,461,4,4
10,32217,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Manual 6-spd,Premium Gasoline,6,3.8,89,0,18.1909,22.8000,26.7761,37.9000,21.2581,420,5,5
11,32218,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Manual 6-spd,Premium Gasoline,4,2.0,94,0,20.8232,25.7303,31.7255,43.9687,24.6323,360,6,6
12,32219,Lincoln,MKS AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.7,0,105,18.0431,22.6000,25.9987,36.7000,20.9244,424,5,5
13,32220,Lincoln,MKS AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,0,105,17.1523,21.4000,25.0000,35.6000,20.0543,446,5,5
14,32221,Lincoln,MKS FWD,2013,Large Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.7,0,105,17.9906,22.5290,26.5429,37.5393,21.0415,422,5,5
15,32231,Mazda,6,2013,Midsize Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.7,0,102,17.7357,21.7000,26.6826,34.6000,20.8874,463,5,5
16,32232,Ford,Taurus AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,0,102,18.1170,22.7000,25.5432,36.0000,20.8440,426,5,5
17,32233,Ford,Taurus AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,0,102,17.1523,21.4000,25.0000,35.6000,20.0543,446,5,5
18,32234,Ford,Taurus AWD FFV,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,0,102,18.1170,22.7000,25.5432,36.0000,20.8440,426,5,5
19,32235,Ford,Taurus FWD,2013,Large Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,0,102,19.3144,24.3290,28.1465,40.0311,22.4901,395,6,6

In [247]:
import pandas as pd
sr = pd.Series(['New_York', 'Lisbon', 'Texas', 'Paris', 'California'])
idx = ['City 1', 'City 2', 'City 3', 'City 4', 'City 5']

In [248]:
sr

0      New_York
1        Lisbon
2         Texas
3         Paris
4    California
dtype: object

In [250]:
result = sr.str.contains(pat = 'is')

In [252]:
sr[result]

1    Lisbon
3     Paris
dtype: object

In [276]:
auto=fuel['trans'].str.contains('Automatic')

In [277]:
fuel[auto]

,id,make,model,year,VClass,drive,trans,fuelType,cylinders,displ,...,pv4,city,UCity,highway,UHighway,comb,co2,feScore,ghgScore,new
0,32204,Nissan,GT-R,2013,Subcompact Cars,All-Wheel Drive,Automatic (AM6),Premium Gasoline,6,3.8,...,0,16.4596,20.2988,22.5568,30.1798,18.7389,471,4,4,Automatic
1,32205,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Automatic (AM-S6),Premium Gasoline,4,2.0,...,0,21.8706,26.9770,31.0367,42.4936,25.2227,349,6,6,Automatic
2,32206,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.6,...,0,17.4935,21.2000,26.5716,35.1000,20.6716,429,5,5,Automatic
3,32207,Volkswagen,CC 4motion,2013,Compact Cars,All-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.6,...,0,16.9415,20.5000,25.2190,33.5000,19.8774,446,5,5,Automatic
4,32208,Chevrolet,Malibu eAssist,2013,Midsize Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,4,2.4,...,95,24.7726,31.9796,35.5340,51.8816,28.6813,310,8,8,Automatic
5,32209,Lexus,GS 350,2013,Midsize Cars,Rear-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.5,...,99,19.4325,24.1499,28.2234,38.5000,22.6002,393,6,6,Automatic
6,32210,Lexus,GS 350 AWD,2013,Midsize Cars,All-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.5,...,99,18.5752,23.5261,26.3573,36.2109,21.4213,412,5,5,Automatic
7,32214,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Automatic 8-spd,Premium Gasoline,4,2.0,...,0,17.4460,21.7946,26.6295,37.6731,20.6507,432,5,5,Automatic
9,32216,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Automatic 8-spd,Premium Gasoline,6,3.8,...,0,16.4675,20.4839,24.5605,34.4972,19.3344,461,4,4,Automatic
12,32219,Lincoln,MKS AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.7,...,105,18.0431,22.6000,25.9987,36.7000,20.9244,424,5,5,Automatic
13,32220,Lincoln,MKS AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,105,17.1523,21.4000,25.0000,35.6000,20.0543,446,5,5,Automatic
14,32221,Lincoln,MKS FWD,2013,Large Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.7,...,105,17.9906,22.5290,26.5429,37.5393,21.0415,422,5,5,Automatic
15,32231,Mazda,6,2013,Midsize Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.7,...,102,17.7357,21.7000,26.6826,34.6000,20.8874,463,5,5,Automatic
16,32232,Ford,Taurus AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,102,18.1170,22.7000,25.5432,36.0000,20.8440,426,5,5,Automatic
17,32233,Ford,Taurus AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,102,17.1523,21.4000,25.0000,35.6000,20.0543,446,5,5,Automatic
18,32234,Ford,Taurus AWD FFV,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,102,18.1170,22.7000,25.5432,36.0000,20.8440,426,5,5,Automatic
19,32235,Ford,Taurus FWD,2013,Large Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,102,19.3144,24.3290,28.1465,40.0311,22.4901,395,6,6,Automatic

In [278]:
manual=fuel['trans'].str.contains('Manual')

In [279]:
fuel[manual]

,id,make,model,year,VClass,drive,trans,fuelType,cylinders,displ,...,pv4,city,UCity,highway,UHighway,comb,co2,feScore,ghgScore,new
8,32215,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Manual 6-spd,Premium Gasoline,4,2.0,...,0,20.6741,26.2000,29.2741,41.8000,23.8235,375,6,6,Automatic
10,32217,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Manual 6-spd,Premium Gasoline,6,3.8,...,0,18.1909,22.8000,26.7761,37.9000,21.2581,420,5,5,Automatic
11,32218,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Manual 6-spd,Premium Gasoline,4,2.0,...,0,20.8232,25.7303,31.7255,43.9687,24.6323,360,6,6,Automatic

In [282]:
flight

  operator_code  route_code duration  dur_min
0           AXZ          12    2h 5m      125
1           DTR          32    3h 7m      187
2           AXZ          34    7h 3m      423
3           AXZ          12   2h 15m      135
4           YUN           8   1h 10m       70
5           YUN          12   2h 10m      130
6           YUN          13   3h 55m      235
7           DTR          16   3h 30m      210
8           DTR          18   6h 10m      370
9           AXZ          13   3h 45m      225

In [284]:
mult_group

operator_code  route_code
AXZ            12            260
               13            225
               34            423
DTR            16            210
               18            370
               32            187
YUN            8              70
               12            130
               13            235
Name: dur_min, dtype: int64

In [288]:
mult_df=pd.DataFrame(mult_group)

In [291]:
mult_df.reset_index()

  operator_code  route_code  dur_min
0           AXZ          12      260
1           AXZ          13      225
2           AXZ          34      423
3           DTR          16      210
4           DTR          18      370
5           DTR          32      187
6           YUN           8       70
7           YUN          12      130
8           YUN          13      235

In [292]:
flight

  operator_code  route_code duration  dur_min
0           AXZ          12    2h 5m      125
1           DTR          32    3h 7m      187
2           AXZ          34    7h 3m      423
3           AXZ          12   2h 15m      135
4           YUN           8   1h 10m       70
5           YUN          12   2h 10m      130
6           YUN          13   3h 55m      235
7           DTR          16   3h 30m      210
8           DTR          18   6h 10m      370
9           AXZ          13   3h 45m      225

In [293]:
d_list=flight['duration'].to_list()

In [296]:
d_list

['2h 5m',
 '3h 7m',
 '7h 3m',
 '2h 15m',
 '1h 10m',
 '2h 10m',
 '3h 55m',
 '3h 30m',
 '6h 10m',
 '3h 45m']

In [300]:
d_min=[]
for val in d_list:
    result=0
    h,m=val.split()
    result=int(h[:-1])*60+int(m[:-1])
    d_min.append(result)
d_min

[125, 187, 423, 135, 70, 130, 235, 210, 370, 225]

In [302]:
flight['new_col']=d_min

In [303]:
flight

  operator_code  route_code duration  dur_min  new_col
0           AXZ          12    2h 5m      125      125
1           DTR          32    3h 7m      187      187
2           AXZ          34    7h 3m      423      423
3           AXZ          12   2h 15m      135      135
4           YUN           8   1h 10m       70       70
5           YUN          12   2h 10m      130      130
6           YUN          13   3h 55m      235      235
7           DTR          16   3h 30m      210      210
8           DTR          18   6h 10m      370      370
9           AXZ          13   3h 45m      225      225

In [305]:
new_s=pd.Series(d_min)
flight['new_col2']=new_s.values

In [306]:
flight

  operator_code  route_code duration  dur_min  new_col  new_col2
0           AXZ          12    2h 5m      125      125       125
1           DTR          32    3h 7m      187      187       187
2           AXZ          34    7h 3m      423      423       423
3           AXZ          12   2h 15m      135      135       135
4           YUN           8   1h 10m       70       70        70
5           YUN          12   2h 10m      130      130       130
6           YUN          13   3h 55m      235      235       235
7           DTR          16   3h 30m      210      210       210
8           DTR          18   6h 10m      370      370       370
9           AXZ          13   3h 45m      225      225       225

In [307]:
flight

  operator_code  route_code duration  dur_min  new_col  new_col2
0           AXZ          12    2h 5m      125      125       125
1           DTR          32    3h 7m      187      187       187
2           AXZ          34    7h 3m      423      423       423
3           AXZ          12   2h 15m      135      135       135
4           YUN           8   1h 10m       70       70        70
5           YUN          12   2h 10m      130      130       130
6           YUN          13   3h 55m      235      235       235
7           DTR          16   3h 30m      210      210       210
8           DTR          18   6h 10m      370      370       370
9           AXZ          13   3h 45m      225      225       225

In [315]:
flight.drop('new_col',axis=1,inplace=True)

In [317]:
flight.drop('new_col2',axis=1,inplace=True)

In [318]:
flight

  operator_code  route_code duration  dur_min
0           AXZ          12    2h 5m      125
1           DTR          32    3h 7m      187
2           AXZ          34    7h 3m      423
3           AXZ          12   2h 15m      135
4           YUN           8   1h 10m       70
5           YUN          12   2h 10m      130
6           YUN          13   3h 55m      235
7           DTR          16   3h 30m      210
8           DTR          18   6h 10m      370
9           AXZ          13   3h 45m      225

In [319]:
flight['operator_code'].value_counts()

AXZ    4
YUN    3
DTR    3
Name: operator_code, dtype: int64

In [321]:
flight['operator_code'].value_counts()

AXZ    4
YUN    3
DTR    3
Name: operator_code, dtype: int64

In [347]:
fuel=pd.read_csv('fuel_econ.csv').head(20)

In [348]:
fuel['type']=fuel['trans'].apply(lambda x: x.split(' ')[0])

In [349]:
fuel

,id,make,model,year,VClass,drive,trans,fuelType,cylinders,displ,...,pv4,city,UCity,highway,UHighway,comb,co2,feScore,ghgScore,type
0,32204,Nissan,GT-R,2013,Subcompact Cars,All-Wheel Drive,Automatic (AM6),Premium Gasoline,6,3.8,...,0,16.4596,20.2988,22.5568,30.1798,18.7389,471,4,4,Automatic
1,32205,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Automatic (AM-S6),Premium Gasoline,4,2.0,...,0,21.8706,26.9770,31.0367,42.4936,25.2227,349,6,6,Automatic
2,32206,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.6,...,0,17.4935,21.2000,26.5716,35.1000,20.6716,429,5,5,Automatic
3,32207,Volkswagen,CC 4motion,2013,Compact Cars,All-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.6,...,0,16.9415,20.5000,25.2190,33.5000,19.8774,446,5,5,Automatic
4,32208,Chevrolet,Malibu eAssist,2013,Midsize Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,4,2.4,...,95,24.7726,31.9796,35.5340,51.8816,28.6813,310,8,8,Automatic
5,32209,Lexus,GS 350,2013,Midsize Cars,Rear-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.5,...,99,19.4325,24.1499,28.2234,38.5000,22.6002,393,6,6,Automatic
6,32210,Lexus,GS 350 AWD,2013,Midsize Cars,All-Wheel Drive,Automatic (S6),Premium Gasoline,6,3.5,...,99,18.5752,23.5261,26.3573,36.2109,21.4213,412,5,5,Automatic
7,32214,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Automatic 8-spd,Premium Gasoline,4,2.0,...,0,17.4460,21.7946,26.6295,37.6731,20.6507,432,5,5,Automatic
8,32215,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Manual 6-spd,Premium Gasoline,4,2.0,...,0,20.6741,26.2000,29.2741,41.8000,23.8235,375,6,6,Manual
9,32216,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Automatic 8-spd,Premium Gasoline,6,3.8,...,0,16.4675,20.4839,24.5605,34.4972,19.3344,461,4,4,Automatic
10,32217,Hyundai,Genesis Coupe,2013,Subcompact Cars,Rear-Wheel Drive,Manual 6-spd,Premium Gasoline,6,3.8,...,0,18.1909,22.8000,26.7761,37.9000,21.2581,420,5,5,Manual
11,32218,Volkswagen,CC,2013,Compact Cars,Front-Wheel Drive,Manual 6-spd,Premium Gasoline,4,2.0,...,0,20.8232,25.7303,31.7255,43.9687,24.6323,360,6,6,Manual
12,32219,Lincoln,MKS AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.7,...,105,18.0431,22.6000,25.9987,36.7000,20.9244,424,5,5,Automatic
13,32220,Lincoln,MKS AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,105,17.1523,21.4000,25.0000,35.6000,20.0543,446,5,5,Automatic
14,32221,Lincoln,MKS FWD,2013,Large Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.7,...,105,17.9906,22.5290,26.5429,37.5393,21.0415,422,5,5,Automatic
15,32231,Mazda,6,2013,Midsize Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.7,...,102,17.7357,21.7000,26.6826,34.6000,20.8874,463,5,5,Automatic
16,32232,Ford,Taurus AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,102,18.1170,22.7000,25.5432,36.0000,20.8440,426,5,5,Automatic
17,32233,Ford,Taurus AWD,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,102,17.1523,21.4000,25.0000,35.6000,20.0543,446,5,5,Automatic
18,32234,Ford,Taurus AWD FFV,2013,Large Cars,All-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,102,18.1170,22.7000,25.5432,36.0000,20.8440,426,5,5,Automatic
19,32235,Ford,Taurus FWD,2013,Large Cars,Front-Wheel Drive,Automatic (S6),Regular Gasoline,6,3.5,...,102,19.3144,24.3290,28.1465,40.0311,22.4901,395,6,6,Automatic